# Dropping entries from an axisâ€¯

In [1]:
#importing pandas as pd
import pandas as pd 

 
data = {
    "name":["Sally", "Mary", "John"],
    "age":[50, 40, 30],
    "qualified":[True, False, False]
       }

df = pd.DataFrame(data)


newdf = df.drop("age", axis = 'columns')

#print the Dataframe
print(newdf)

    name  qualified
0  Sally       True
1   Mary      False
2   John      False

In [4]:
#print the Dataframe
newdf

    name  qualified
0  Sally       True
1   Mary      False
2   John      False

In [5]:
#print the Dataframe
print(df)
print(newdf)

    name  age  qualified
0  Sally   50       True
1   Mary   40      False
2   John   30      False
    name  qualified
0  Sally       True
1   Mary      False
2   John      False